<?php
///////////////////////////////// Бригада 6////////////////////////////////
///////////////////////////////////////////////////////////////////////////
//                                                                       //
// 1 Используя переменные $color и $size сформировать php-скрипт, который//
// выводит на экран строку текста заданным цветом и размером.            //
//                                                                       //
///////////////////////////////////////////////////////////////////////////

$color = "green";
$size = "50px";
$text = "Это 1 задание из 5-6 лабораторной работы";

echo "<p style='color: $color; font-size: $size;'>$text</p>";

///////////////////////////////////////////////////////////////////////////////
//                                                                           //
// 2 В php-скрипте создайте переменную $var1 со значением "Alice", переменную//
// var2 = "My friend is $var1", переменную var3 = 'My friend is $var1'.      //
// Объясните, чем отличаются результаты присваиваний в var2 и var3. Создайте //
// переменную $var4, являющуюся ссылкой на переменную $var1. Отобразите на   //
// экране значения всех переменных до, а затем после присвоения переменной   // 
// $var1 значения "Bob".                                                     //  
// Затем создайте переменную $user со значением "Michael" и динамическую     //
// переменную $$user со значением "Jackson".                                 //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

$var1 = "Alice";
$var2 = "My friend is $var1";
$var3 = 'My friend is $var1';
// результаты отличаются тем, что в первом сслучае за счет двойных ковычек 
// мы ссылаемся на var1, в отличие от второго варианта, где ссылки нет
$var4 = "$var1";

$color = "red";
$size = "30px";

echo "<p style='color: $color; font-size: $size;'>$var1</p>
<p style='color: $color; font-size: $size;'>$var2</p>
<p style='color: $color; font-size: $size;'>$var3</p>
<p style='color: $color; font-size: $size;'>$var4</p>";

////////////////////////////////////////////////////////////////////////////////
// после присваивания значения Боб:
$var1 = "Bob";
$var2 = "My friend is $var1";
$var3 = 'My friend is $var1';
$var4 = "$var1";

$color = "blue";
$size = "30px";

echo "<p style='color: $color; font-size: $size;'>$var1</p>
<p style='color: $color; font-size: $size;'>$var2</p>
<p style='color: $color; font-size: $size;'>$var3</p>
<p style='color: $color; font-size: $size;'>$var4</p>";

////////////////////////////////////////////////////////////////////////////////

$user = "Michael";
$Michael = "Jackson";

echo($$user);

///////////////////////////////////////////////////////////////////////////////
//                                                                           //                            
//3. 1.Создайте переменную $e со значением 2.718281                          //
//   2.Выведите на экран значение этой переменной в виде строки              //
//    "Число Эйлера равно …".                                                // 
//   3.Последовательно измените тип переменной $e на строковый, целый и      //
//     булевский.                                                            //
//   4.Отобразите тип и получившееся значение переменной $e.                 //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

$e = 2.718281;//double

$color = "Orange";
$size = "30px";
echo "<p style='color: $color; font-size: $size;'>Число Эйлера равно: $e</p>";

///////////////////////////////////////////////////////////////////////////////

$e = 2.718281;//double
$e = (integer)$e;//int

$color = "Pink";
$size = "30px";
echo "<p></p>";
echo gettype($e), "<h style='color: $color; font-size: $size;'> $e</h>";

///////////////////////////////////////////////////////////////////////////////

$e = 2.718281;//double
$e = (boolean)$e;//bool

$color = "Pink";
$size = "30px";
echo "<p></p>";
echo gettype($e), "<h style='color: $color; font-size: $size;'> $e</h>";

///////////////////////////////////////////////////////////////////////////////

$e = 2.718281;//double
$e = (string)$e;//string

$color = "Pink";
$size = "30px";
echo "<p></p>";
echo gettype($e), "<h style='color: $color; font-size: $size;'> $e</h>";

///////////////////////////////////////////////////////////////////////////////
//                                                                           //                            
//4 Для решения задачи необходимо использовать операторы if-else-elseif.     //
//Значения переменных должны задаваться в строке вызова скрипта.             //
//В переменной min лежит число от 0 до 59 (значение переменной вводится в    //
//строке вызова скрипта z06-1.php?min=1). Определите, в какую четверть часа  //
//попадает это число (в первую, вторую, третью или четвертую).               //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

echo "<p></p>";
echo "<p></p>";
$color = "olive";
$size = "30px";

$min = $_GET['min'];

if ($min >= 0 && $min <= 14) 
{
    echo "<p style ='color: $color; font-size: $size;'>$min минут -Первая четверть часа</p>";
} 
elseif ($min >= 15 && $min <= 29) 
{
    echo "<p style ='color: $color; font-size: $size;'>$min минут -Вторая четверть часа</p>";
} 
elseif ($min >= 30 && $min <= 44) 
{
    echo "<p style ='color: $color; font-size: $size;'>$min минут -Третья четверть часа</p>";
} 
elseif ($min >= 45 && $min <= 59) 
{
    echo "<p style ='color: $color; font-size: $size;'>$min минут -Четвертая четверть часа</p>";
} 

///////////////////////////////////////////////////////////////////////////////
//                                                                           //                            
//5 Используя вложенные циклы for отобразите  сложениe чисел от 1 до 10      //
//При этом цвет цифр в верхней строке и левом столбце должен быть задан через//
//$color вне циклов, а в левой верхней ячейке должен стоять знак "+"         // 
//красного цвета. Ширина рамки таблицы равна 1, отступ содержимого ячеек     //
//от границы равен 5                                                         //
//                                                                           //
///////////////////////////////////////////////////////////////////////////////

$color = "violet"; 
$shirina = 1; 
$otstyp = 5;

echo '<table border="' .$shirina. '" cellpadding="' .$otstyp. '">';

// Верхняя строка с цветными цифрами
echo '<tr>';
echo '<td style="color: red;">+</td>'; 
for ($i = 1; $i <= 10; $i++) 
{
    echo '<td style="color: ' . $color . ';">' . $i . '</td>';
}
echo '</tr>';

// Остальные строки с суммами чисел
for ($i = 1; $i <= 10; $i++) {
    echo '<tr>';
    echo '<td style="color: ' . $color . ';">' . $i . '</td>'; // Ячейка слева с числом
    for ($j = 1; $j <= 10; $j++) 
    {
        echo '<td>' . ($i + $j) . '</td>'; // Ячейка со сложением
    }
    echo '</tr>';
}

echo '</table>';

////////////////////////////////////////////////////////////////////////////////
?>